const endings = [

   ['мин', 'мина'],
 
   ['сий', 'сия'],
 
   ['гей', 'гия'],
 
   ['ман', 'мана'],
 
   ['тор', 'тора'],
 
   ['Зоя', 'Зои'],
 
   ['дра', 'дры'],
 
   ['иил', 'иила'],
 
   ['ест', 'еста'],
 
   ['лья', 'льи'],
 
   ['рон', 'рона'],
 
   ['ера', 'еры'],
 
   ['рей', 'рея'],
 
   ['сим', 'сима'],
 
   ['рья', 'рьи'],
 
   ['вел', 'вла'],
 
   ['дор', 'дора'],
 
   ['нья', 'ньи'],
 
   ['арк', 'арка'],
 
   ['ид','ида'],
 
   ['фан','фана'],
 
   ['ара','ары'],
 
   ['ий','ия'],
 
   ['на','ны'],
 
   ['лл','лла'],
 
   ['та','ты'],
 
   ['ида','иды'],
 
   ['ис','иса'],
 
   ['нн','нна'],
 
   ['овь','ови'],
 
   ['жда','жды'],
 
   ['ика','ики'],
 
   ['еб','еба'],
 
   ['фим','фима'],
 
   ['рх','рха'],
 
   ['ия','ии'],
 
   ['лав','лава'],
 
   ['ндр','ндра'],
 
   ['имир','имира'],
 
   ['льга','льги'],
 
   ['тин','тина'],
 
   ['аил','аила'],
 
   ['фон','фона'],
 
   ['лег','лега'],
 
   ['Лев','Льва'],
 
   ['авва','аввы'],
 
   ['лла','ллы'],
 
   ['нна','нны'],
 
   ['орь', 'оря'],
 
   ['сей', 'сея'],
 
   ['имма', 'иммы'],
 
   ['адий', 'адия'],
 
   ['лай', 'лая'],
   ['мила', 'милы']
 
 ];

export const transformName = name => {
    let newName;
    for(let i = 0; i < endings.length; i++) {
       let end = endings[i][0];
       let newEnd = endings[i][1];
       const regex = new RegExp(`${end}$`,'g');
       const changedName = name.replace(regex, `${newEnd}`);
       if(changedName!=name) newName = changedName;
     }
   return newName;
 }

